const text = `
2023/12/28
友人宅で爆睡して起きて二度寝したら 11 時だった。つくば号で東京駅に戻ると人々がスーツケースを引いていて、年末を感じた。
高校の人間と忘年会をした。今年は年忘れの機会がいっぱいあって良いな。

2023/12/29
朝頃に帰って、風呂で仮眠して、忘年会 2（ツー）に行った。年の瀬には例年中島みゆきの「時代」を聴くようにしていて、
これを聴くと今年も締めくくりだなという気がする。ぽしゃけを飲みながら、あの人はああだ、この人はこうだ、と話をするのだけれど、
全てを見透かしたような顔をしている我々も、結局はその人の僅かな側面しか捉えられていないわけで、
それで人々を囃し立てたりするのは時期尚早かな、とうっすら考えていた。明日から冬コミだ！

2023/12/30
C103、1 日目。初参戦の C99 から数えて今年で 3 回目となる冬コミだった。
目当てのサークルさんを早々に回り切ったので、他ジャンルの島や企業ブースを物色していた。同人誌即売会はやっぱりたのしい。
帰り際に年忘れの六厘舎に行った、これも 3 年目。
そういえば、とあるサークルで高校同期に酷似した人を見掛けたので、久しぶりに DM を送ってみた。
P.S. 明日はえっちな本が並びます。
!c103.webp|コミックマーケット開催時の東京ビッグサイト

2023/12/31
C103、2 日目。表現の自由はいいな〜と思いながら会場内を歩いていた。会場限定の商品は 6 時間半並んだ末に直前で売り切れたものの、楽しかったので ok。
寒空の下、並びながら今年の振り返りエントリを書いていた。閉会時に会場一同で拍手をするのが恒例で、その瞬間に人の温かみを感じた。
知り合いに来年は組版同人誌を作りませんかと声を掛けていただいたので、サークル側で出ることを目標としたい。どうぞ良いお年を〜。

2024/1/1
あけおめ〜。年賀状を印刷して就寝し、親に朝叩き起こされて帰省。新幹線に乗っていたので地震には気が付かなかった。

2024/1/2
久しぶりに昼まで寝ていた。起きて墓参り、散歩、夕食。
散歩から帰ったら飛行機が燃えていた（多分川崎にいたら自転車で空港まで見に行っていたと思う）。
＊＊の締切が近いので新年始めて PC を開いた。

2024/1/3
門司に行った。父方の実家は＊＊……から＊＊離れた＊＊とかいう辺鄙な地にあり、普通に北九州にあればよかったのにと思った。
「もじこう」の T シャツがマジで可愛くてマジで可愛かったんだけれど値段が大分張ったので、代わりにマグネットを買った。この正月で一番テンションが上がった。

2024/1/5
無限に労働していた。＊＊は＊＊だと思います。

2024/1/7
長い長い帰省からつくばに戻ってきた。朝方に千里川に飛行機を観に行った。
帰り際に名古屋・岐阜に（ひとりで）寄って帰る予定だったものの、レポート（実世界）& 労働の進捗がマズすぎるので月末にリスケ。

2024/1/9
黎明からレポート（進捗：半分）をやって昼頃に散歩に出た。高校時代によく通っていたらーめん屋に行った。
昼の柔和な日差しを受けながら河原を散歩していると、春の近さを感じさせられた。松の内も終わった頃に年賀状を書いた。
画像
!leaf.webp|鶴見川沿いの葉っぱ

2024/1/10
早朝から仕事、レポート、実験、夜に盛清六に行ってドカ食い気絶をして今起きた。

2024/1/11
レポートを仕上げてようやく秋 B を脱出した。寒さが肌に刺さる冬の日で、ファミマでおでんを買って食べた。⛄️🧣❄️
!sunset.webp|夕暮れの空

2024/1/12
起きたら 14:30 だった。十余年ぶりに Wii スポーツをやって、その後に松のやでミルフィーユカツを食べた。胃もたれした。そのままつくば号で帰郷。

2024/1/13
めちゃくちゃ美味いステーキを食べた……と思ったら夢だった。起きたらリビングのテレビが付け放しで、
ジャパネットたかたの 60 分枠で鉄板焼セットの紹介をしていた。ぐぬぬ。
午後からだらだらと＊＊を進めた。進捗 30/59。俺ガイルが無料配信中なのでこれを流しながら明日も＊＊の予定。

2024/1/14–15
＊＊をひたすら進めてようやく終わらせた。その後 1 年以上壊れていた KdB もどきの CI を直した、YAML とは仲良くなれなさそう。
パスポートを申請した。近所のスーパーに行ったら物価高騰の余波を感じた。

2024/1/16
風が冷たく、雲は大きく、夕暮れは眩しい一日だった。早朝に起きて蒼に開凸、限定 15 杯の激うまらーめんを食べた。
春先に台湾に行くので地球の歩き方を買って読んでいた。
いなにわうどん.みんなに移動ログを付けたいなと思ったので、microCMS や Foursquare API を弄っていた。 
!cloud.webp|春日 4 丁目の雲

2024/1/17
労働で＊＊をした後、実験に行った。久しぶりにストゼロを飲んで爆睡していた。

2024/1/18
昼頃に起きて松屋に行った。授業に行こうか迷ったが、どうせ出席ないしなと家でパソコンをしていたら出席が生えたっぽい、許すまじ。
タコを焼いて食べた。小麦の配分を間違えて鈴カステラみたいだった。

2024/1/19
8 時頃に起床、4 時にアラームを掛けたのに 4 時間もスヌーズしていた。研究室に行って課題の相談をした。
実験後に新年初福軒に行ってドカ食い。目が覚めたら横浜だった。
!akadama.webp|自転車のカゴに入る赤玉パンチ

2024/1/20
中学の友人とベイブレードをした。メタルファイトの重厚な戦いっぷりを十数年ぶりに見て、X の拙速さを求めるスタイルに時代の流れを感じた。夜にスシローに行った。 

2024/1/21
朝までベイブレードをして、帰宅後に個人開発をしていた。有意義な午前中。
昼から家族で川崎大師に初詣（今更？）に行ったんだけれど、木の札に人々は 5000 円や 1 万を払っていて信仰ってすげ〜〜と感じた。

2024/1/22
夕方頃に起きた。個人開発の続きで個人サイトに Swarm 機能を実装していた（POI を取得する API は Foursquare のそれなのでほぼ同一）。
月末に名古屋に行くのでそれまでにデプロイしたいな。

2024/1/23
授業に出て久しぶりに＊＊に行った。夜にカレーメシを食べた。

2024/1/24
自動運転のバスに乗った。お昼時に粉クリに言ったら偶然友人に遭遇してそのまま COJT へ。夕方から研究室の実験強力に行った。オタクとカラオケに行った。

2024/1/25
昼間に家系らーめんをドカ食いして死亡、ムビチケカードが余っていたので貸切状態の映画館で青ブタを観た。
ZEYO に行ったら友人が無料券を2連で引いていた。労働の進捗がまずい。

2024/1/26
実験に行った後まもなく帰宅。夜行バスに乗って一人名古屋・岐阜旅行へ。

2024/1/27
安達としまむらの聖地巡礼で大垣・岐阜・本巣を周遊。あだしまはマジで良いので全人類観てください。
樽見鉄道も良かったな、今度全線乗りに行きたい。夜は栄でぽしゃけのみ。
!minobe.webp|見延公園

2024/1/28
名古屋市内観光。名古屋城や名古屋港、名古屋テレビ塔に加え、あだしまの聖地である名古屋駅桜通口等を巡った。
昼食は名古屋名物・ひつまぶし、夕食には味噌煮込みうどんを食べた。
名古屋はほぼ初上陸に近い（厳密には一度だけ来たことある）ので嬉しい。

2024/1/29
旅行から戻ってきた、長時間の高速バスは疲れる。帰宅後溜まりに溜まった労働を消化。
2 ヶ月ほど格闘していた＊＊の＊＊に漸く終わりが見えてきて嬉しい。久しぶりにデッサンしたいな。

2024/1/30
昼にポンデリングを食べた以外の記憶がない、多分寝ていたんだと思う。

2024/1/31
1 年生に Next.js を教えていた、あと労働。昼に粉クリに行った。

2024/2/1
1 年生に Hono を教えていた（優秀でびっくりした）。あと 3 週間ぶり労働ミーティング。夜に大元に行った、大元はいいぞ！！

2024/2/2
COJT 最終発表、そのあとに打ち上げ。山崎 12 年が飲めてニコニコになった。
＊＊で＊＊がブルートフォースしている横で酒を煽っていた。爆睡して起きたら朝で、松のやに行った。
人間関係とは無常なもので、これからは人々と逢う機会も自ずと減っていくことに思いを巡らせ、寂寥を憶えていた。
2 月の朝とは思えないほどの温暖な気候で、季節は確実に前に進んでいることを実感した。 

2024/2/3
一日寝ていた。最近ポンデリングのうまさに開眼しつつある。

2024/2/4
個人開発を進めつつ聖地巡礼記を書いていた。個人ブログは良い。
午後から 2 月初旬に品川近辺の寒緋桜を見に行くのが恒例となりつつあるので見に行った。晴れている日にもう一回写真撮りに行きたいな。
新橋まで歩くと駅前の一等地に昭和の面影を残した雑居ビルがあり、再開発で消えていない貴重な東京が垣間見えてよかった。

2024/2/5
渋谷に所用があったので、ついでに雪景色の都内を見てきた。
都心に雪が降ったら葛西臨海公園に行くと年頭に宣言していたので（好きなアニメに雪景色の葛西臨海公園を訪問するシーンがある）、その目標が果たせてニコニコ。 
!kasai.webp|葛西臨海公園

2024/2/6
積雪で授業が飛んだので引きこもり。労働と趣味開発を半々にした。
この前後輩くんが食べていたローラスカラメルビスケットのお菓子を買って食べた。 

2024/2/7
一日眠たかった。気概を出してつくばに行くぞ！と思い駅前を歩いていたら、
地元の友人にエンカウントして飯に行ったのでつくば行きを断念。

2024/2/8
8 時に起きてオンラインでゼミに参加、そのあと仮眠をとりつつ労働。
親の風邪が移ったっぽく、ぼーっとしていた。早めに寝よう……。

2024/2/9
起きたら 15 時過ぎだった。散歩に行って近所の梅の定点観測、八分咲きくらいだった。夜からパソコンを開いて研究室の課題と個人開発。
今年は良い春になるんじゃないかな、と予感がした。

2024/2/10
起きたら17時過ぎだった。風邪が微妙に続いていて体調が悪い。
テレビを付けて「人生の楽園」を観たら愛知県の燻製屋を特集していて、いつかは人生の楽園に取り上げられるような暮らしをしてみたいなと思った。

2024/2/11
「もじ イメージ Graphic 展」に行った。
写研の「森・林」のポスター（山城隆一）が複製ではあるものの展示されていて、紙媒体で見るのは初めてだったので激アツだった。
夜に新宿に行って昨春ぶりに激ウマらーめんを食べた。
!shibuya.webp|渋谷のエスカレータ

2024/2/12
課題と労働。夜に食べに行ったカレー屋のテレビで仮装大賞をやっていて、仮装大賞だなあと思った。

2024/2/13
昼頃に起床。写研 100 書体復刻のニュースが出ており大歓喜の一日だった。
パスポートを受け取りに行って、秋葉原を散策して筑波に来た。夜通しで労働。

2024/2/14
朝まで労働、その後オンラインでゼミに出て二度寝。昼から所用で三学に行くと、取られたと思っていた自転車が見つかった。
自転車も見つかったことだし油虎に行った。爆睡して先程起床し、これから労働。

2024/2/15
朝まで労働、その後オンラインでゼミに出て二度寝。昼から芸専の卒展を見に行った。
XD を使ったアプリの提案などもあり、あー我々も負けてられんなと思った（実装力で差を見せていきたい）。
仕事のミーティングに出て、2 ヶ月掛けて進めてきた＊＊がようやくマージできそうでニコニコに。

2024/2/16
前日の 23:30 に起床、朝までレポートを書いて誠寿司に開凸した。
午後から研究室の発表練習、静岡大のFFが筑波に来ていたので会いに行った。
夜に新年会、人々の歌唱シーンが見られて貴重だった。

2024/2/17
解散後まもなくつくば号に乗って帰宅、睡眠不足気味だったので一日寝ていた。
最近友人と人間関係を保つのは難しいねみたいな話をよくする気がする。

2024/2/18
家でパソコンしていた。＊＊の記事を読んで、陳腐な表現で申し訳ないものの、凄いな頑張ってほしいなと切に思った。物事の初心は大事にしたい。
ところで、TL に未踏の成果発表関連のツイが流れてきてあー 3 年かーという気持ちになった。
組版や文字への熱は未だに続いていて（コンピュータと同等に長い）、未踏時代の経験はその後に十分生きているんだけれど、
やはり Twight 自体を世に出せなかったのは悔やまれるばかりだなあ……と感じた。

2024/2/19
朝からレポート消化、卒研を除く学部最後のレポートはカスのゴミレポになってしまった……。
徹夜明けで研究室のゼミ（オンライン）に出て二度寝。親に東京に行くぞ！と言われたので東京に行った。
でも行先は決まってなかったので馬喰町に行った。
横須賀線（千葉以西）の未制覇駅は衣笠、田浦、東逗子、西大井、新小岩、市川、稲毛の残り 7 駅。

2024/2/20
朝 1 時に起きて 10 時間ほど労働、PR をいっぱい投げた。
その後数時間ほど仮眠を取って趣味開発。esbuild, Babel とバトルをしていた（敗北）。よくコードを書いた一日だった。
春休みは例年コーディングへの気持ちが高まる代わりに人間関係への興味が希薄になりがちで、まあ良いんだか悪いんだかという感じだ（体験としては悪くない）。

2024/2/21
最近は昼夜逆転が酷く、朝 1 時に起きた。
その後 10 時間ほど仕事をして久しぶりにお布団で寝た。起きたら 17 時半で、趣味開発をした。

2024/2/22
引き続き朝まで仕事をした。
3/15 のダイヤ改正で鶴見線の 205 系が廃止されると聞いたので、最後の 1 編成に乗って鶴見–扇町間を移動した。
復路は新型の E131 系に乗った。LCD が設置され、自動放送が流れる鶴見線の車内はかなり隔世の感という感じだった。
!tsurumi-line.webp|鶴見線のホーム

2024/2/23
朝までネレネー山脈だったのでネットサーフィンしていた。
15 時ころに起きて二度寝。特に何もしない一日だった。荷造りして寝る。

2024/2/24
学類同期と台湾にきた。4 年ぶりの海外なのでテンション上がりまくりだった。
台北はスルーして高雄に来たが、高鐵左營に降り立った瞬間にアジア特有の空気感があって懐かしい〜となった。
!flight.webp|成田空港での航空機

2024/2/25
台湾旅行 2 日目。高雄の芸術特区やウォータフロント周辺、旗津等を巡った。良すぎ。

2024/2/26
台湾旅行 3 日目。高雄を離れて台北に来た。台北101の展望台に登ったりした。

2024/2/27
台湾旅行 4 日目。台北市内の秋葉原的な場所を訪れた後、かの有名な九份に行った。無限に中国茶を飲んでいた。

2024/2/28
台湾旅行 5 日目。台北市内の王道な観光名所を巡って、修学旅行の最終日に近しい感覚を感じた（清水寺をみんなで巡るような雰囲気）。
今日は二・二八事件の記念日で台湾は祝日らしい。

2024/2/29
台湾旅行最終日。空港泊を経て朝の便で日本に帰国した。
台湾はかなり街並みや文化、治安等が日本に近く、気軽に行きやすい海外だなあと感じた。来年もまたどこかに行きたいな。

2024/3/1
3月になってしまった！！ 疲れが溜まっていたのでよく寝て、溜まっていた労働を消化した（できてない）。
個人サイトに旅行の写真を載せてみた。昨年の北海道と比較して明らかに写真の色味が変わっており、富士フイルム恐るべし……になった。

2024/3/2
秋葉原に行った（奇しくも UDX で SecHack の発表会が催されていたものの先約があり行けず……）。
中学の頃から追っている三上ミカ先生という同人作家の方がサイン会を開いていて、サインを貰って感激！という感じだった。
壁面に飾ってあった伊藤いづも先生のサインも拝んでしまった……。秋葉原駅周辺で友人とすれ違った。
!izumo.webp|伊藤いづも先生のサイン

2024/3/3
朝まで仕事をして惰眠を貪った後、家族ととんかつを食べた。
久しぶりに WORD に記事を出すかと思い、確定申告体験記を書き出したら予想以上に知らないことがあってびっくり。
「響け！ユーフォニアム」を見始めた。
中学時代から団体活動や上下関係みたいなものに真面目に取り組んだことがないのであまり感情移入できないな……と思いつつ、
あーこういう部活に打ち込むみたいな世界線も（別世界には）存在したんだなーと勉強になった。

2024/3/4
昨日に引き続き「響け！ユーフォニアム 2」を観始めた。
京アニすげ〜と思いながら観ていたんだけれど、優良児と呼ばれる京アニですら超薄給なことに気付いてぬーん……となっていた。
学部 2 年とかの暇な頃ってパソコンをやるんじゃなくて、
将来関わらなさそう（だが興味がある分野、例えば映像編集とか出版とかアニメとか）のアルバイト等に行った方が
実は良かったんかなあみたいなことをぼんやりと考えていた。

2024/3/5
引き続き「響け！ユーフォニアム 2」を観ていた。
受験と部活との葛藤……！みたいな耳をすませば的な展開が登場し、人々は様々な物事を諦めて大人になるんだなあと思った。
一方で自分は学生団体にあまり好意的な感情を持てていないので、その感情がどこから来るのかを言語化したりしていた。
あとは仕事のミーティングに出た。影響がデカい PR を作るのは緊張する。
夕方から横浜に行って、昨年のインターンでご一緒した知人ともんじゃを食べた。フロントエンドのことを話していた。

2024/3/6
朝までアニメを見て就寝。起きたら 18 時だった。
＊＊を始めたが、そのためにはまず＊＊から始める必要があり、未だにまだ終わってない。カス。

2024/3/7
高校同期とプリントやきいもの会をした。
我々が激推しする東扇島東公園は京浜工業地帯の工場群を眺めながらバーベキューが楽しめておすすめです。
2020 年に初めて今年で 4 回目で、なんだか色々と懐かしいなあという気持ちになった。 

2024/3/8
かなり昼夜逆転という感じで、朝までアニメを観てドカ寝する生活が続いている。今日は 16:00 に起きた。春眠だ〜いすき！

2024/3/9
特になにもない平和な一日だった。
16 時頃に起きてパソコン、ネットサーフィン、アニメ鑑賞みたいな感じで一日が終わった。
近年の若者としては珍しく地上波テレビが結構好きで、（特に実家にいると）ぼーっとテレビを眺めている機会は多い。
土曜日の夕方にやってる人生の楽園はお気に入りの番組で、今日は京都の右京区に移住してカフェを営む人の特集だった。
あーこういう余生を送りたいっす……。

2024/3/10
「リズと青い鳥」を観た。高 1 の頃から気になっていて、6 年越しにようやく履修できた。
主従や依存に近しい関係にあった二人が、進路実現や才能の落差等の様々な要因によって逆転していく様子、
そこに交錯する感情を透明感のある世界観の中に描いていて、いや非常に良かった……。
他のアニメなんかを観ても時折感じるんだけれど、かつては感情の機微みたいなものが確かに遍在していて、
大学に入って日常の安寧を得るととともに、そうした繊細な感性が徐々に死んでいく様子には儚さを感じるばかりで……。
そんなわけで朝まで起きていたので、近所を散歩した。
久しぶりにうららかな日差しを浴びて春を感じ、帰って爆睡して起きたら 19 時だった。最近寝ても寝ても眠いな。
!sakura.webp|近所の桜

2024/03/11
朝まで起きていた。Wasm というものを触ってみるかと思い立ち、とはいえ Rust は書けないので golang で
適当なフィルタを書いてみたが普通に JS で処理するより遅くて泣いちゃった。
昼過ぎから大船に行った。大船は湘南周辺に行く際の通過駅ではあるものの、
ちゃんと降りて街を見るのは 5 年ぶりくらいだなと思った。湘南モノレール、良い。

2024/3/12
朝まで仕事、＊＊がほぼ終わった。夜から旅行で下呂に行く。

2024/3/13
高校同期と下呂温泉に来た。友人の運転に揺られて 5 時頃に到着。
温泉、喫食、飲酒、爆睡を繰り返して慰安旅行という感じ。

2024/3/14
下呂温泉続き。深夜に風呂に入って朝に風呂に入って昼に風呂に入ってと無限に入浴を嗜んでいた。
旅行に行くと規則正しく三食食べちゃうので腹が痛い。

2024/3/15
南武線の最終で帰ってきた。疲れたので朝まで寝て、仕事して、ヒトカラに行った。
一人で行くと、集団で行ったときにはおそらく歌わないであろう曲が歌えて楽しい。
3 月も気が付けば 15 日（！）。今週末は労働の消化と研究室の課題を進めていきたい。

2024/3/16
ひたすらデバッグしていた。スクリプトを動かすのに 1 時間とか時間が掛かるので、
その間にアニメを 1 クール見たり惰眠を貪ったりしていたら一日が終わった。寝ても寝ても眠いよ〜。

2024/3/17
朝2時頃に起床、＊＊が終わったので結果を報告して、＊＊を始めるために Swift に入信した。
OOP と React を混ぜたような感じで良く解らんな……。16 時頃に寝て 0 時前に起きた。散髪失敗。

2024/3/18
朝まで起きていた。このまま寝ようか迷ったが、天気も良かったので千葉に行った。
目標は散歩、聖地巡礼、千葉都市モノレールに乗るといった感じで、
南船橋→稲毛海岸→千葉みなと→千葉→千城台→千葉中央→稲毛海岸→稲毛→千葉 の順に回った。
増殖したマッ缶の自販機や、千葉都市モノレール 2 号線の全線、稲毛陸橋、二郎の千葉店等を訪れて大変満足。
!chiba.webp|千葉都市モノレール

2024/3/19
起きたら朝 6 時で一周回って健康的な起床となった。
朝からゼミ（オンライン）に出て、その後仕事、ミーティング、終わってからは Twitter を観ていたら一日が終わった。
今日のトピックは htmx っぽい。

2024/3/20
中学同期と集まった。なんだかんだで 10 年来の付き合いになり長い。
我々は元々美術部にいたので、クロッキー帳、鉛筆、パステル等を買って模写をしてみた。
鉛筆を持つのは久しぶりで上手く描けなかったが、
手が黒く染まっていく感覚は懐かしく、たまにはパソコンを離れてこういうのも悪くないなと思った。
あとはサイゼに行って注文用紙で鶴を折っていた。
!adashima.webp|安達としまむらの模写

2024/3/21-22
＊＊で房総半島にきた。昼間は＊＊、夜は＊＊という感じで、自分の発表は特に問題なく終わった。
＊＊＊＊＊＊＊＊、あと人が多すぎて名前覚えられず……。
＊＊（に限った話でもないと思うけど）は、＊＊＊＊＊＊＊だが、多くはその影を追っているという感じで、＊＊＊＊＊＊＊＊という所存です。

2024/3/23
あと一週間で春休みが終わってしまう！やりたいことは特に終わらず……。
今日はなんか眠気が取れず一日寝ていた。まあ春休みは休むのが仕事ですからね〜。

2024/3/24
朝2時頃に起床。風呂に入って Chrome の更新をしたら待望の text-spacing-trim プロパティがサポートされていたので、Zenn に記事を書いた。
その後労働で＊＊＊＊。14 時頃に寝て、18 時頃に叩き起こされ、22 時頃にもう一回寝た。
俺ガイル完また観てしまった（何周目？）。

2024/3/25
朝 2 時に起床、風呂に入って 6 時頃に二度寝し、起きたときには 10 時半とかだった。
20 生の卒業式だったらしく、お布団の中から応援していた。
昨日に引き続き仕事のバグ修正。text-spacing-trim プロパティがバグっているというツイートを見掛けたので、
フォントデータを調べてみたらテーブルに欠陥があったことが判り、Zenn にまとめたらそれなりに反響があってびっくりした。
その後は＊＊を読んでいた。これが結構激ヤバ処理で、世界にはまだ知らないことが無限にあるなあと思った。
組版日和の一日だった。
`;

export default text;
