const text = `
2023/12/28
友人宅で爆睡して起きて二度寝したら 11 時だった。つくば号で東京駅に戻ると人々がスーツケースを引いていて、年末を感じた。
高校の人間と忘年会をした。今年は年忘れの機会がいっぱいあって良いな。

2023/12/29
朝頃に帰って、風呂で仮眠して、忘年会 2（ツー）に行った。年の瀬には例年中島みゆきの「時代」を聴くようにしていて、
これを聴くと今年も締めくくりだなという気がする。ぽしゃけを飲みながら、あの人はああだ、この人はこうだ、と話をするのだけれど、
全てを見透かしたような顔をしている我々も、結局はその人の僅かな側面しか捉えられていないわけで、
それで人々を囃し立てたりするのは時期尚早かな、とうっすら考えていた。明日から冬コミだ！

2023/12/30
C103・1 日目。初参戦の C99 から数えて今年で 3 回目となる冬コミだった。
目当てのサークルさんを早々に回り切ったので、他ジャンルの島や企業ブースを物色していた。同人誌即売会はやっぱりたのしい。
帰り際に年忘れの六厘舎に行った、これも 3 年目。
そういえば、とあるサークルで高校同期に酷似した人を見掛けたので、久しぶりに DM を送ってみた。
P.S. 明日はえっちな本が並びます。
!20231230.webp|コミックマーケット開催時の東京ビッグサイト

2023/12/31
C103・2 日目。表現の自由はいいな〜と思いながら会場内を歩いていた。会場限定の商品は 6 時間半並んだ末に直前で売り切れたものの、楽しかったので ok。
寒空の下、並びながら今年の振り返りエントリを書いていた。閉会時に会場一同で拍手をするのが恒例で、その瞬間に人の温かみを感じた。
知り合いに来年は組版同人誌を作りませんかと声を掛けていただいたので、サークル側で出ることを目標としたい。どうぞ良いお年を〜。

2024/1/1
あけおめ〜。年賀状を印刷して就寝し、親に朝叩き起こされて帰省。新幹線に乗っていたので地震には気が付かなかった。

2024/1/2
久しぶりに昼まで寝ていた。起きて墓参り、散歩、夕食。
散歩から帰ったら飛行機が燃えていた（多分川崎にいたら自転車で空港まで見に行っていたと思う）。
＊＊の締切が近いので新年始めて PC を開いた。

2024/1/3
門司に行った。父方の実家は＊＊から＊＊離れた＊＊とかいう辺鄙な地にあり、普通に北九州にあればよかったのにと思った。
「もじこう」の T シャツがマジで可愛くてマジで可愛かったんだけれど値段が大分張ったので、代わりにマグネットを買った。この正月で一番テンションが上がった。

2024/1/5
無限に労働していた。＊＊は＊＊だと思います。

2024/1/7
長い長い帰省からつくばに戻ってきた。朝方に千里川に飛行機を観に行った。
帰り際に名古屋・岐阜に（ひとりで）寄って帰る予定だったものの、レポート（実世界）& 労働の進捗がマズすぎるので月末にリスケ。

2024/1/9
黎明からレポート（進捗：半分）をやって昼頃に散歩に出た。高校時代によく通っていたらーめん屋に行った。
昼の柔和な日差しを受けながら河原を散歩していると、春の近さを感じさせられた。松の内も終わった頃に年賀状を書いた。
!20240109.webp|鶴見川沿いの葉っぱ

2024/1/10
早朝から仕事、レポート、実験、夜に盛清六に行ってドカ食い気絶をして今起きた。

2024/1/11
レポートを仕上げてようやく秋 B を脱出した。寒さが肌に刺さる冬の日で、ファミマでおでんを買って食べた。⛄️🧣❄️
!20240111.webp|夕暮れの空

2024/1/12
起きたら 14 時半だった。友人宅で十余年ぶりに Wii スポーツをプレイし、その後に松のやでミルフィーユカツを食べた。
胃もたれした。そのままつくば号で帰郷。

2024/1/13
めちゃくちゃ美味いステーキを食べた……と思ったら夢だった。起きたらリビングのテレビが付け放しで、
ジャパネットたかたの 60 分枠で鉄板焼セットの紹介をしていた。ぐぬぬ。
午後からだらだらと＊＊を進めた。進捗 30/59。俺ガイルが無料配信中なのでこれを流しながら明日も＊＊の予定。

2024/1/14–15
＊＊をひたすら進めてようやく終わらせた。その後 1 年以上壊れていた KdB もどきの CI を直した、YAML とは仲良くなれなさそう。
パスポートを申請した。近所のスーパーに行ったら物価高騰の余波を感じた。

2024/1/16
風が冷たく、雲は大きく、夕暮れは眩しい一日だった。早朝に起きて蒼に開凸、限定 15 杯の激うまらーめんを食べた。
春先に台湾に行くので地球の歩き方を買って読んでいた。
いなにわうどん.みんなに移動ログを付けたいなと思ったので、microCMS や Foursquare API を弄っていた。 
!20240116.webp|春日 4 丁目の雲

2024/1/17
労働で＊＊をした後、実験に行った。
学内の某部屋で飲酒をし、久しぶりにストゼロを飲んで爆睡していた。

2024/1/18
昼頃に起きて松屋に行った。授業に行こうか迷ったが、どうせ出席ないしなと家でパソコンをしていたら出席が生えたっぽい、許すまじ。
友人とタコを焼いて食べた。小麦の配分を間違えて鈴カステラみたいだった。

2024/1/19
8 時頃に起床、4 時にアラームを掛けたのに 4 時間もスヌーズしていた。研究室に行って課題の相談をした。
実験後に新年初福軒に行ってドカ食い。目が覚めたら横浜だった。
!20240119.webp|自転車のカゴに入る赤玉パンチ

2024/1/20
中学の友人とベイブレードをした。メタルファイトの重厚な戦いっぷりを十数年ぶりに見て、X の拙速さを求めるスタイルに時代の流れを感じた。夜にスシローに行った。 

2024/1/21
朝までベイブレードをして、帰宅後に個人開発をしていた。有意義な午前中。
昼から家族で川崎大師に初詣（今更？）に行ったんだけれど、木の札に人々は 5000 円や 1 万を払っていて信仰ってすげ〜〜と感じた。

2024/1/22
夕方頃に起きた。個人開発の続きで個人サイトに Swarm 機能を実装していた（POI を取得する API は Foursquare のそれなのでほぼ同一）。
月末に名古屋に行くのでそれまでにデプロイしたいな。

2024/1/23
授業に出て久しぶりに＊＊に行った。夜にカレーメシを食べた。

2024/1/24
自動運転のバスに乗った。お昼時に粉クリに言ったら偶然友人に遭遇してそのまま COJT へ。
夕方から研究室の実験協力に行った。オタクとカラオケに行った。

2024/1/25
昼間に家系らーめんをドカ食いして死亡、ムビチケカードが余っていたので貸切状態の映画館で青ブタを観た。
ZEYO. に行ったら友人が無料券を2連で引いていた。労働の進捗がまずい。

2024/1/26
実験に行った後まもなく帰宅。夜行バスに乗って一人名古屋・岐阜旅行へ。

2024/1/27
安達としまむらの聖地巡礼で大垣・岐阜・本巣を周遊。あだしまはマジで良いので全人類観てください。
樽見鉄道も良かったな、今度全線乗りに行きたい。夜は栄でぽしゃけのみ。
!20240127.webp|見延公園

2024/1/28
名古屋市内観光。名古屋城や名古屋港、名古屋テレビ塔に加え、あだしまの聖地である名古屋駅桜通口等を巡った。
昼食は名古屋名物・ひつまぶし、夕食には味噌煮込みうどんを食べた。
名古屋はほぼ初上陸に近い（厳密には一度だけ来たことある）ので嬉しい。
!20240128.webp|名古屋港

2024/1/29
旅行から戻ってきた、長時間の高速バスは疲れる。帰宅後溜まりに溜まった労働を消化。
2 ヶ月ほど格闘していた＊＊の＊＊に漸く終わりが見えてきて嬉しい。久しぶりにデッサンしたいな。

2024/1/30
昼にポンデリングを食べた以外の記憶がない、多分寝ていたんだと思う。

2024/1/31
1 年生に Next.js を教えていた、あと労働。昼に粉クリに行った。

1 月のふりかえり
一月往ぬるというのは本当だ……。
人々は進捗を産むことに執念しているが、私はゆっくりと健やかに過ごすことに専念したいなと思った。
春は旅行にいっぱい行きたいな。

2024/2/1
1 年生に Hono を教えていた（優秀でびっくりした）。
あと 3 週間ぶり労働ミーティング。夜に大元に行った、大元はいいぞ！！

2024/2/2
COJT 最終発表、そのあとに打ち上げ。山崎 12 年が飲めてニコニコになった。
＊＊で＊＊がブルートフォースしている横で酒を煽っていた。爆睡して起きたら朝で、松のやに行った。
人間関係とは無常なもので、これからは人々と逢う機会も自ずと減っていくことに思いを巡らせ、寂寥を憶えていた。
2 月の朝とは思えないほどの温暖な気候で、季節は確実に前に進んでいることを実感した。 

2024/2/3
一日寝ていた。最近ポンデリングのうまさに開眼しつつある。

2024/2/4
個人開発を進めつつ聖地巡礼記を書いていた。個人ブログは良い。
午後から 2 月初旬に品川近辺の寒緋桜を見に行くのが恒例となりつつあるので見に行った。晴れている日にもう一回写真撮りに行きたいな。
新橋まで歩くと駅前の一等地に昭和の面影を残した雑居ビルがあり、再開発で消えていない貴重な東京が垣間見えてよかった。

2024/2/5
渋谷に所用があったので、ついでに雪景色の都内を見てきた。
都心に雪が降ったら葛西臨海公園に行くと年頭に宣言していたので（好きなアニメに雪景色の葛西臨海公園を訪問するシーンがある）、その目標が果たせてニコニコ。 
!20240205.webp|葛西臨海公園

2024/2/6
積雪で授業が飛んだので引きこもり。労働と趣味開発を半々にした。
この前後輩くんが食べていたローラスカラメルビスケットのお菓子を買って食べた。 

2024/2/7
一日眠たかった。気概を出してつくばに行くぞ！と思い駅前を歩いていたら、
地元の友人にエンカウントして飯に行ったのでつくば行きを断念。

2024/2/8
8 時に起きてオンラインでゼミに参加、そのあと仮眠をとりつつ労働。
親の風邪が移ったっぽく、ぼーっとしていた。早めに寝よう……。

2024/2/9
起きたら 15 時過ぎだった。散歩に行って近所の梅の定点観測、八分咲きくらいだった。夜からパソコンを開いて研究室の課題と個人開発。
今年は良い春になるんじゃないかな、と予感がした。

2024/2/10
起きたら 17 時過ぎだった。風邪が微妙に続いていて体調が悪い。
テレビを付けて「人生の楽園」を観たら愛知県の燻製屋を特集していて、いつかは人生の楽園に取り上げられるような暮らしをしてみたいなと思った。

2024/2/11
「もじ イメージ Graphic 展」に行った。
写研の「森・林」のポスター（山城隆一）が複製ではあるものの展示されていて、紙媒体で見るのは初めてだったので激アツだった。
夜に新宿に行って昨春ぶりに激ウマらーめんを食べた。
!20240211.webp|渋谷のエスカレータ

2024/2/12
課題と労働。夜に食べに行ったカレー屋のテレビで仮装大賞をやっていて、仮装大賞だなあと思った。

2024/2/13
昼頃に起床。写研 100 書体復刻のニュースが出ており大歓喜の一日だった。
パスポートを受け取りに行って、秋葉原を散策して筑波に来た。夜通しで労働。

2024/2/14
朝まで労働、その後オンラインでゼミに出て二度寝。昼から所用で三学に行くと、取られたと思っていた自転車が見つかった。
自転車も見つかったことだし油虎に行った。爆睡して先程起床し、これから労働。

2024/2/15
朝まで労働、その後オンラインでゼミに出て二度寝。昼から芸専の卒展を見に行った。
XD を使ったアプリの提案などもあり、あー我々も負けてられんなと思った（実装力で差を見せていきたい）。
仕事のミーティングに出て、2 ヶ月掛けて進めてきた＊＊がようやくマージできそうでニコニコに。

2024/2/16
前日の 23 時半に起床、朝までレポートを書いて誠寿司に開凸した。
午後から研究室の発表練習、静岡大のFFが筑波に来ていたので会いに行った。
夜に新年会、人々の歌唱シーンが見られて貴重だった。

2024/2/17
解散後まもなくつくば号に乗って帰宅、睡眠不足気味だったので一日寝ていた。
最近友人と人間関係を保つのは難しいねみたいな話をよくする気がする。

2024/2/18
家でパソコンしていた。＊＊の記事を読んで、陳腐な表現で申し訳ないものの、凄いな頑張ってほしいなと切に思った。物事の初心は大事にしたい。
ところで、TL に未踏の成果発表関連のツイが流れてきてあー 3 年かーという気持ちになった。
組版や文字への熱は未だに続いていて（コンピュータと同等に長い）、未踏時代の経験はその後に十分生きているんだけれど、
やはり Twight 自体を世に出せなかったのは悔やまれるばかりだなあ……と感じた。

2024/2/19
朝からレポート消化、卒研を除く学部最後のレポートはカスのゴミレポになってしまった……。
徹夜明けで研究室のゼミ（オンライン）に出て二度寝。親に東京に行くぞ！と言われたので東京に行った。
でも行先は決まってなかったので馬喰町に行った。
横須賀線（千葉以西）の未制覇駅は衣笠、田浦、東逗子、西大井、新小岩、市川、稲毛の残り 7 駅。

2024/2/20
朝 1 時に起きて 10 時間ほど労働、PR をいっぱい投げた。
その後数時間ほど仮眠を取って趣味開発。esbuild, Babel とバトルをしていた（敗北）。よくコードを書いた一日だった。
春休みは例年コーディングへの気持ちが高まる代わりに人間関係への興味が希薄になりがちで、まあ良いんだか悪いんだかという感じだ（体験としては悪くない）。

2024/2/21
最近は昼夜逆転が酷く、朝 1 時に起きた。
その後 10 時間ほど仕事をして久しぶりにお布団で寝た。起きたら 17 時半で、趣味開発をした。

2024/2/22
引き続き朝まで仕事をした。
3/15 のダイヤ改正で鶴見線の 205 系が廃止されると聞いたので、最後の 1 編成に乗って鶴見–扇町間を移動した。
復路は新型の E131 系に乗った。LCD が設置され、自動放送が流れる鶴見線の車内はかなり隔世の感という感じだった。
!20240222.webp|鶴見線のホーム

2024/2/23
朝までネレネー山脈だったのでネットサーフィンしていた。
15 時ころに起きて二度寝。特に何もしない一日だった。荷造りして寝る。

2024/2/24
学類同期と台湾にきた。4 年ぶりの海外なのでテンション上がりまくりだった。
台北はスルーして高雄に来たが、高鐵左營駅に降り立った瞬間にアジア特有の空気感が漂い、4 年前のマレーシア旅行を思い出して懐かしい〜となった。
夜は六合夜一に行って名物を食べたりぽしゃけを飲んだりした。
!20240224.webp|成田空港での航空機

2024/2/25
台湾旅行 2 日目。高雄の芸術特区やウォータフロント周辺、旗津等を巡った。良すぎ。

2024/2/26
台湾旅行 3 日目。龍虎塔周辺を巡った後、高雄を離れて台北に来た。念願の台北 101 の展望台に登ったりした。

2024/2/27
台湾旅行 4 日目。台北市内の秋葉原的な場所を訪れた後、かの有名な九份に行った。無限に中国茶を飲んでいた。

2024/2/28
台湾旅行 5 日目。台北市内の王道な観光名所（台湾総督府、故宮博物院等）を巡って、修学旅行の最終日に近しい感覚を感じた
（清水寺をみんなで巡るような雰囲気）。
今日は二・二八事件の記念日で台湾は祝日らしい。

2024/2/29
台湾旅行最終日。空港泊を経て朝の便で日本に帰国した。
台湾はかなり街並みや文化、治安等が日本に近く、気軽に行きやすい海外だなあと感じた。来年もまたどこかに行きたいな。

2 月のふりかえり
今年の 2 月はかなり順調という感じだった。
趣味開発や仕事、研究室の課題を進めつつ、適度に外に出て人間と交流したり、旅行に行けたりしたのが良かった。 

2024/3/1
3月になってしまった！！ 疲れが溜まっていたのでよく寝て、溜まっていた労働を消化した（できてない）。
個人サイトに旅行の写真を載せてみた。昨年の北海道と比較して明らかに写真の色味が変わっており、富士フイルム恐るべし……になった。

2024/3/2
秋葉原に行った（奇しくも UDX で SecHack の発表会が催されていたものの先約があり行けず……）。
中学の頃から追っている三上ミカ先生という同人作家の方がサイン会を開いていて、サインを貰って感激！という感じだった。
壁面に飾ってあった伊藤いづも先生のサインも拝んでしまった……。秋葉原駅周辺で友人とすれ違った。
!20240302.webp|伊藤いづも先生のサイン

2024/3/3
朝まで仕事をして惰眠を貪った後、家族ととんかつを食べた。
久しぶりに WORD に記事を出すかと思い、確定申告体験記を書き出したら予想以上に知らないことがあってびっくり。
「響け！ユーフォニアム」を見始めた。
中学時代から団体活動や上下関係みたいなものに真面目に取り組んだことがないのであまり感情移入できないな……と感じつつ、
あーこういう部活に打ち込むみたいな世界線も（別世界には）存在したんだなーと勉強になった。

2024/3/4
昨日に引き続き「響け！ユーフォニアム 2」を観始めた。
京アニすげ〜と思いながら観ていたんだけれど、優良児と呼ばれる京アニですら超薄給なことに気付いてぬーん……となっていた。
学部 2 年とかの暇な頃ってパソコンをやるんじゃなくて、
将来関わらなさそう（だが興味がある分野、例えば映像編集とか出版とかアニメとか）のアルバイト等に行った方が
実は良かったんかなあみたいなことをぼんやりと考えていた。

2024/3/5
引き続き「響け！ユーフォニアム 2」を観ていた。
受験と部活との葛藤……！みたいな耳をすませば的な展開が登場し、人々は様々な物事を諦めて大人になるんだなあと悟った。
一方で自分は学生団体にあまり好意的な感情を持てていないので、その感情がどこから来るのかを言語化したりしていた。
あとは仕事のミーティングに出た。影響がデカい PR を作るのは緊張する。
夕方から横浜に行って、昨年のインターンでご一緒した知人ともんじゃを食べた。フロントエンドのことを話していた。

2024/3/6
朝までアニメを見て就寝。起きたら 18 時だった。
＊＊を始めたが、そのためにはまず＊＊から始める必要があり、未だにまだ終わってない。カス。

2024/3/7
高校同期とプリントやきいもの会をした。
我々が激推しする東扇島東公園は京浜工業地帯の工場群を眺めながらバーベキューが楽しめておすすめです。
2020 年に初めて今年で 4 回目で、なんだか色々と懐かしいなあという気持ちになった。 

2024/3/8
かなり昼夜逆転という感じで、朝までアニメを観てドカ寝する生活が続いている。今日は 16 時に起きた。春眠だ〜いすき！

2024/3/9
特になにもない平和な一日だった。
16 時頃に起きてパソコン、ネットサーフィン、アニメ鑑賞みたいな感じで一日が終わった。
近年の若者としては珍しく地上波テレビが結構好きで、（特に実家にいると）ぼーっとテレビを眺めている機会は多い。
土曜日の夕方にやってる人生の楽園はお気に入りの番組で、今日は京都の右京区に移住してカフェを営む人の特集だった。
あーこういう余生を送りたいっす……。

2024/3/10
「リズと青い鳥」を観た。高 1 の頃から気になっていて、6 年越しにようやく履修できた。
主従や依存に近しい関係にあった二人が、進路実現や才能の落差等の様々な要因によって逆転していく様子、
そこに交錯する感情を透明感のある世界観の中に描いていて、いや非常に良かった……。
他のアニメなんかを観ても時折感じるんだけれど、かつては感情の機微みたいなものが確かに遍在していて、
大学に入って日常の安寧を得るととともに、そうした繊細な感性が徐々に死んでいく様子には儚さを感じるばかりで……。
そんなわけで朝まで起きていたので、近所を散歩した。
久しぶりにうららかな日差しを浴びて春を感じ、帰って爆睡して起きたら 19 時だった。最近寝ても寝ても眠いな。
!20240310.webp|近所の桜

2024/03/11
朝まで起きていた。Wasm というものを触ってみるかと思い立ち、とはいえ Rust は書けないので golang で
適当なフィルタを書いてみたが普通に JS で処理するより遅くて泣いちゃった。
昼過ぎから大船に行った。大船は湘南周辺に行く際の通過駅ではあるものの、
ちゃんと降りて街を見るのは 5 年ぶりくらいだなと思った。湘南モノレール、良い。

2024/3/12
朝まで仕事、＊＊がほぼ終わった。夜から旅行で下呂に行く。

2024/3/13
高校同期と下呂温泉に来た。友人の運転に揺られて 5 時頃に到着。
温泉、喫食、飲酒、爆睡を繰り返して慰安旅行という感じ。

2024/3/14
下呂温泉続き。深夜に風呂に入って朝に風呂に入って昼に風呂に入ってと無限に入浴を嗜んでいた。
旅行に行くと規則正しく三食食べちゃうので腹が痛い。
夜は八王子周辺のつけ麺屋に入った。

2024/3/15
南武線の最終で帰ってきた。疲れたので朝まで寝て、仕事をした後ヒトカラに行った。
一人で行くと、集団で行ったときには恐らく歌わないであろう曲が歌えて楽しい。
3 月も気が付けば 15 日（！）。今週末は労働の消化と研究室の課題を進めていきたい。

2024/3/16
ひたすらデバッグしていた。スクリプトを動かすのに 1 時間とか時間が掛かるので、
その間にアニメを 1 クール見たり惰眠を貪ったりしていたら一日が終わった。寝ても寝ても眠いよ〜。

2024/3/17
朝 2 時頃に起床、＊＊が終わったので結果を報告して、研究室の課題を始めるために Swift に入信した。
OOP と React を混ぜたような感じで良く解らんな……。16 時頃に寝て 0 時前に起きた。散髪失敗。

2024/3/18
朝まで起きていた。このまま寝ようか迷ったが、天気も良かったので千葉に行った。
目標は散歩、聖地巡礼、千葉都市モノレールに乗るといった感じで、
南船橋→稲毛海岸→千葉みなと→千葉→千城台→千葉中央→稲毛海岸→稲毛→千葉 の順に回った。
増殖したマッ缶の自販機や、千葉都市モノレール 2 号線の全線、稲毛陸橋、ラーメン二郎 千葉店等を訪れることができて大変満足。
!20240318.webp|千葉都市モノレール

2024/3/19
目覚めたら朝 6 時で一周回って健康的な起床となった。
朝からゼミ（オンライン）に出て、その後仕事、ミーティング、終わってからは Twitter を観ていたら一日が終わった。
本日のトピックは htmx っぽい。

2024/3/20
中学同期と集まった。なんだかんだで 10 年来の付き合いになり長い。
我々は元々美術部にいたので、クロッキー帳、鉛筆、パステル等を買って模写をしてみた。
鉛筆を持つのは久しぶりで上手く描けなかったが、
手が黒く染まっていく感覚は懐かしく、たまにはパソコンを離れてこういうのも悪くないなと思った。
あとはサイゼに行って注文用紙で鶴を折っていた。
!20240320.webp|安達としまむらの模写

2024/3/21-22
研究室の合宿で房総半島にきた。昼間は発表会、夜は懇親会という感じで、自分の発表は特に問題なく終わった。
＊＊＊＊＊＊、あと人が多すぎて名前覚えられず……。
＊＊（に限った話でもないと思うけど）は、＊＊＊＊＊＊で、＊＊＊＊＊＊という所存です。

2024/3/23
あと一週間で春休みが終わってしまう！やりたいことは特に終わらず……。
今日はなんか眠気が取れず一日寝ていた。まあ春休みは休むのが仕事ですからね〜。

2024/3/24
朝 2 時頃に起床。風呂に入って Chrome の更新をしたら待望の text-spacing-trim プロパティがサポートされていたので、Zenn に記事を書いた。
その後労働で＊＊＊＊＊＊。14 時頃に寝て、18 時頃に叩き起こされ、22 時頃にもう一回寝た。
俺ガイル完また観てしまった（何周目？）。

2024/3/25
朝 2 時に起床、風呂に入って 6 時頃に二度寝し、起きたときには 10 時半とかだった。
20 生の卒業式だったらしく、お布団の中から応援していた。
昨日に引き続き仕事のバグ修正。text-spacing-trim プロパティがバグっているというツイートを見掛けたので、
フォントデータを調べてみたらテーブルに欠陥があったことが判り、Zenn にまとめたらそれなりに反響があってびっくりした。
その後は＊＊を読んでいた。これが結構激ヤバ処理で、世界にはまだ知らないことが無限にあるなあと思った。
組版日和の一日だった。

2024/3/26
久しぶりに徹夜してしまった……。
日報も大分溜まってきたのと、春休みも終わるなあと思ったのである程度ぼかしたうえで個人サイトに転記してみた: https://いなにわうどん.みんな/articles/diary。
所用でつくばに来た。引き継ぎがあったので研究室に行き、
食欲はあまりなかったのでご飯はカップ麺で済ませ、富士書店で漫画や同人誌を見て帰ってきた。部屋が寒い。 

2024/3/27
朝 8 時半に起床、家族旅行でいわきに来た。常磐線に揺られて双葉町周辺を見に行った。
駅前から国道 6 号線に向かってぶらぶらと歩き、件のケーズデンキも訪れた。
駅周辺はほとんど人もおらず、放置された商店や停電した自販機が 13 年の空白を伝えていた。
!20240327.webp|双葉町の道路

2024/3/28
10 年ぶりに水戸に来た。
水戸、想像以上に都会で（セイコーマートがある！）、ゆくゆくはつくば市が水戸を追い抜くとかマジの 𝑓𝑎𝑘𝑒 𝑛𝑒𝑤𝑠…… と感じた。

2024/3/29
朝から昼まで寝ていた。春が近づいてきて暖かくなるとお昼寝が気持ち良い……。
そういえばリスケになった仕事のミーティングがあったことを開始 2 分前に思い出し、ボサボサの頭で出席してしまった。

2024/3/30
徹夜して労働、趣味等をしていた。久々にイラレを弄った。
印刷物のレイアウトは文字間を一字一字詰めたり、所定の位置に改行箇所が来るように調整したりするような
微に入り細を穿つ調整が多く（Web では考え難い）、スクリプト等でもう少し省力化できる部分もあるかなと感じた。
昼にちょっと散歩をした。
3月末、桜はまだ咲いていなかったが、日差しはゴールデンウィーク頃の陽気さで、先日から一転して人々が初夏の装いを纏っていたのが印象的だった。
夜は「響け！ユーフォニアム」の復活上映を観に行った。 

2024/3/31
学部 3 年最終日。研究室の課題を進め、朝頃に寝落ちていた。
昼過ぎに起床。浅草近辺に寄ってからつくばにきた。
墨田公園の桜は三分咲き程度だったが、東京の下町に灯る夜景は燦然と光を放っていた。
暇人ぜひ新年度会でもしましょう〜。

3 月のふりかえり
順調な一月で、特に高校や中学の友人と逢えたのはよかった。
折角なので新年の目標でも建てようかなと思ったが、何かに追われて日々を生きるのは辛いので、
目下の課題を堅実にこなしながら、穏やかに実りある一年を過ごしていきたい。

2024/4/1
新年度！ 友人がポトフを作っていたので新年度会がてら鍋を囲んだ。
朝から研究室の顔合わせ、ゼミ、席決め、挨拶と新年度っぽい一日だった。
夜に懇親がてらサイゼリヤに行った。
!20240401.webp|総合研究棟Bの桜

2024/4/2
所用で朝から研究室に行った。
お昼に三学食堂に行ったら友人がいたので、一緒にご飯を食べた。
昼過ぎに労働のミーティングに出るために coins ラウンジに行くと、
エアコンがガンガンに効いていたので気持ち良くなって 2 時間半ほど昼寝をしてしまった。
三学の桜がそろそろ咲いてきましたね。

2024/4/3
朝からゼミだったので 8 時には起き、9:15 に三学へ。＊＊＊＊＊＊。
昼食に粉クリに行った。
雨が止んだら帰ろうかと思っていたが一日降っていたので、夕方頃に仕方なく三学に自転車を置いて帰ってきた。 

2024/4/4
昼前に起床。研究室の買い出しでコストコに行き、ホットドックを食べた。安い。
その後は履修組みや雑談等をして、19 時半過ぎに帰った。

2024/4/5
昼過ぎに起床。新歓祭の方は賑やかで近づき難い雰囲気だったので、竹園方面に行ってひとり花見をした。
屋外で飲む酒はうまい！ 暇な友人が合流したので、学内の桜が咲いていそうな箇所を周回した。
coins ラウンジを通ると「KdB もどきというのがあって！」と話している声が聞こえ、3 つ下の代にも浸透しているのは感慨深いなと思った。

2024/4/6
昼頃に起きた。IPA 試験が近いのでちょっと勉強してみるかと過去問道場を開いたら何も解らんくて詰んでしまった。
溝に捨てた 7,500 円……。大学界隈がまぶしいな〜と感じる昨今です。

2024/4/7
朝まで労働して昼頃に起床。新宿にユーフォ 3 期の巨大広告が掲出される最終日だったので観に行った。
ついでに千鳥ヶ淵に寄った。桜は綺麗だったが桜を見に来たのか人を見に来たのかよくわからなくなった。

2024/4/8
聖蹟桜ヶ丘周辺を散歩した。聖蹟桜ヶ丘は激推し漫画（アニメ）・まちカドまぞくの舞台であり、
一度行ってみたいと思っていたので、桜の見頃と重なって絶好の機会だった。
地名の通り桜の樹木が至るところに植えてあった。高台に登ったりした。
!20240408.webp|聖蹟桜ヶ丘駅

2024/4/9
朝からゼミでつくばに来た。昼に粉クリを食べ、午後はサーベイや雑談をして帰ってきた。
!20240409.webp|松見池の桜

2024/4/10
朝からゼミ、昼間に研究室で花見に行った。
よく晴れた日の空に反町の森公園の桜が美しく映え、桜の花びらを一枚入れて飲む日本酒は格別だった。
夜は友人と花見に行き、酒をドカドカと飲んだ。
!20240410.webp|反町の森公園の桜

2024/4/11
朝からゼミ。特に何も進捗を生まずに帰ってきてしまった。

2024/4/12
昼頃に起床。起きて Discord を見ると＊＊が山積みになっており、不味いなあと思いつつバグ修正をしていた。
新年度らしく夜は百香亭に行った。新歓シーズンの賑やかな店内で酒を飲んでいると、jsys24 とエンカウントした。 

2024/4/13
友人宅で＊＊的ななにかを作って帰宅した。
7 時頃につくば号に乗ろうと駅前に向かうと、中央公園の桜が見頃を迎えていたので、バスは諦めて 1 時間ほど散歩をしていた。
実家で夕方頃に起床して労働。IPA 試験は時間的に間に合わなさそうなので諦めで……。
!20240417.webp|キロロと桜の花びら

2024/4/14
映画デデデデを観に行った。高校時代から追っているかなり好きな作品。
映画版では浅野いにおの癖がほどよく抜けてポップな感じにまとめられており、ははーと思った。夕食にらーめんを食べた。

2024/4/15
朝からゼミ、学食を訪れると早くも新入生で埋め尽くされていたのでマックを食べた。研究室に一日いた。

2024/4/16
昼過ぎに起床。組込みプログラム開発という大学院の鬼門科目を誤って履修してしまった（しかも早期履修なので切れない）ので
孤軍奮闘で初回に行った。内容は Android + ラズパイの開発という感じだったが、とにかく進度が早かった。
帰りに吉野家に寄ると友人がいたので、卒研決まらないっすね……みたいな話をした。

2024/4/17
朝からゼミ、＊＊＊＊＊＊、＊＊＊＊＊＊、みたいな話をしていた。
午後から健康診断に行き、健康だったのでドルフに行った。
!20240417.webp|人や自転車で賑わうペデストリアンデッキ

2024/4/18
映画を見に行こうと思い起きたら 15 時だったので断念。
＊＊の壁打ちになったり労働のバグ修正に追われていたりしたら夜になっていた。オタクたちとカラオケに来た。 

2024/4/19
飲み過ぎか朝方に帰り松屋に行ったあたりでめちゃくちゃ体調が悪くなってきたので、coins ラウンジのソファーにぶっ倒れていた。
結局 1 限は諦めて、2 限から授業に出た。授業に友人がいた。
昼は本部棟レストランに行くつもりだったが、激混みだったので諦め。
午後からゼミ、資料作成、午前 II の勉強などをした。
最近は＊＊＊＊＊＊しても＊＊＊＊＊＊が多く、こう……という感じだ。 

2024/4/20
昼過ぎに起床。「秒速 5 センチメートル」の復活上映を観に行った。

2024/4/21
ネスペを受けた。3 年前の雙峰祭ぶりの国際会議場でおおっ、と懐かしくなったものの、午後 I で想定通り爆死。
なんだかんだで＊＊と年始初めて会った気がする（最近＊＊はよく見る）。
試験終わりの憂さ晴らしに公園でひとりビールを飲んだ。夜はまだ寒かったのでオタク達と鍋をした。
!20240421.webp|試験問題とビール、鰹の塩辛

2024/4/22
朝からゼミ、授業、研究。昨年の実験班の人々と会ってコスモスに行った。実はつくばで初洋食？

2024/4/23
昼頃に起床、組込みプログラム開発を受講しに三学へ。
親がつくばに来ていたのでとん Q に行った（微妙に高く、普段はあまり食べる機会がないので）。

2024/4/24
研究室で同期が頑張って徹夜をしていたので、アイスを持って 4 時頃に訪れた。
朝からゼミ、昼に三食に行った。労働のミーティングに出て、夜は新人歓迎会でばほばほに行った。

2024/4/25
朝頃に帰り、昼過ぎまで寝ていた。その後課題や趣味開発等の諸々をした。
夜はらーめんを食べて散歩、つくば花室トンネルを眺めて帰ってきた。特に何も無い一日。
!20240425.webp|つくば花室トンネル

2024/4/26
朝から授業、昼にご飯でもと思ったが学食が混みすぎていたので退散。
その後ゼミ、自分の発表（隔週）が初めて回ってきたが、まあ順調な感じだったかと思う。
夜は同期と酒盛りをして、大元に行った。 
!20240426.webp|「ラーメン 第8号店」の看板

2024/4/27
3 時頃に帰宅、大元のウケが良くて安心した。8 時頃に起き、3 年ぶりにオタク達と宇都宮に行った。
昨年開業した LTR は多くの人で賑わっており、高雄で乗ったそれを彷彿とさせた。例によって餃子を食べたりした。 
!20240427.webp|たんぽぽの綿毛

2024/4/28
実家に戻り、昼過ぎまで寝ていた。親の焼いたホットケーキを食べて労働。
ささこいとユーフォを見た。冬物のパジャマを着ていると暑さを感じる昨今で、こうした初夏の気候は嫌いじゃないなと感じた。

2024/4/29
朝まで起きて、久しぶりに個人開発で Web を書いていた（最近はよく Swift を書いている）。
昼頃に起床。寝ている間に為替介入されたのが悔しかったので FX 口座に 10 万円を突っ込んだら 800 円くらい儲かったが、
普通に働いたほうが良さそうだと思った。夕方に浅草に行き、夜から労働。

2024/4/30
4 月最終日！ 徹夜労働を経てつくばにきた。朝からゼミ、激混みのなか昼に粉クリに行った。
午後の組込みプログラム開発はひたすら Java 写経大会の様相を呈しており、かなりしんどかった。
疲れて気付いたときには寝落ちていた。

4 月のふりかえり
研究室生活が始まり、生活リズムから交流関係まで一変した一月だった。
同期とはご飯を食べたり雑談したりをしているので、心労は予想よりも少ないかなという感じ。
研究にどの程度リソースを割くかはまだ計りかねているが、
どのみち今年はやることもないので HCI がんばるぞ！という感じでも良いのかな〜と思い始めてきた。
唯一心残りなのは、これまでの友人と会う機会が減っていくことで……。

2024/5/1
朝から授業……は遅刻して 2 限から出席。
昼に二学食堂に行き、その後ゼミ。
ビアフェスに行こうと話していたが大雨だったので、諦めて 1 年ぶりに清六家に行った。
がんばって研究したのでほめてほめて。

2024/5/2
昼前に起床、ゼミ。朝起きたら為替介入されていて2万円の損！カス！！という気持ちになり、泣く泣く損切りした。
ここで取り戻そうと思うと破滅の未来が見えるのと、ギャンブルより普通にプログラミングのほうがたのしいなと思ったので FX 口座からスッと金を抜いた。
投資信託に回そう……。

2024/5/3
一日実装とサーベイをしていた、HCI わからん。

2024/5/4
昼過ぎに起床。趣味開発で Google カレンダーの API を弄っていた。iCal わからん。
2024/5/6
10 時頃に起床、「ぼっち・ざ・ろっく！展」の最終日に駆け込みで行った。ぼざろ、ぼざろはいいぞ……。
ハイソな街・銀座にきららのオタクが結集している様子が意味不明で良かった。
記念にオリジナル T シャツを買った。
その後はつくばに来て、5 月末で閉店と噂の必道に行った。
!20240506.webp|八丁堀駅

2024/5/7
友人宅に泊まり、松屋の朝定食を食べて僅かに仮眠を取った後ゼミへ。
15 時頃に流石に眠気に耐えきれなくなったので、研究室で 2 時間ほど爆睡した。
夜は高校の友人とはま寿司に行き、ゆるキャンを見た。

2024/5/8
8 時頃に起床。
朝からゼミ、昼に粉クリに行った。
卒研で＊＊のテーマをやろうとしていて、＊＊＊＊＊＊と畏敬の念を持った。
夜に松のやに行った。
!20240508.webp|粉とクリームの店内

2024/5/9
朝まで労働、ちょっと仮眠して昼からまた労働。15 時半から仕事のミーティングに出た。
＊＊にようやく目処が立ち、1 月半ほどかけて仕様書を調べながら取り組んだので結構実装しがいがあった。
＊＊＊＊＊＊。夜は明日のゼミの資料作成。

2024/5/10
ゼミ資料を 10 ページ程度書いて 4 時前に就寝。
朝の授業は寝坊した。昼からゼミ、研究相談、雑談等をして、夜に福軒に行った。
今年も雙峰祭出すよ！！！

2024/5/11
昼過ぎに起床、学内の LT 会に行った。良い機会だったので WORD 部屋の鍵登録をしてもらったが、1 年生が沢山いたので部屋には入らなかった。
人々（元々レイヤが高かった人も含めて）マジでみんな低レイヤに行ってしまったな……という気持ちに。

2024/5/12
昼過ぎに起床、取り溜めたアニメを観たりしていた。

2024/5/13
徹夜労働、ゼミ、昼食、仮眠みたいな感じで一日が終わった。
帰り際にふらっと ZEYO. に寄ったら知り合いがいて気まずかった。

2024/5/14
昼過ぎに起床。
5 限から組込みプログラム開発に行ったが、＊＊＊＊＊＊
（＊＊＊＊＊＊になりつつある）。
今年も React を教える会をやるのでその打ち合わせを軽くして、新年度の交流がてらナマステキッチンに行った。

2024/5/15
2 時頃に帰宅し労働。朝からゼミ。昼に三食に行った。
研究の実装がそこそこ進んできたので、ぼちぼち実験計画を立てたいですねと話していた。
夜は同期と鶏々に行った。その後大学に戻り、＊＊＊＊＊＊。 

2024/5/16
朝 4 時まで労働をして就寝、13 時頃に起床。
仕事のミーティングに出て二度寝した。
変な時間に寝たせいで眠れなくなったので、一人で酒を飲んだ。

2024/5/17
朝から授業、友人がいた。
昼からゼミ、仮眠、雑談、実装みたいな感じで過ごした。
夜に盛清六に行った。新年度初！

2024/5/18
眠れないので、学園南大通りの方まで散歩をした。2 限から CS 専攻の特別講義を受講。
リーダブルコードみたいな感じの話でかなり面白かった。
昼は福軒に行き、夜はオタク達と青椒肉絲を調理した。 
!20240518.webp|黄昏時と焼き芋

2024/5/19
2 年ぶり横田基地友好祭！！ 中学の友人と参加した。
朝 7 時頃に拝島に到着すると既に 1 km ほど待機列が伸びており、2 時間ほど待機して入場。
F-22 の展示や戦闘機のデモフライト等々見られて良かった。海外魔剤ももちろん購入した。
徹夜明けで行ったので体力が早々に底を付き、2 時前には基地を後にした。 
!20240519.webp|横田基地

2024/5/20
5 時過ぎに就寝。
ゼミはオンラインで参加しようと思っていたが、起きたら 12 時前で大絶起、やっぱりオンラインは駄目やね……。
卒研の計画を立て、昼から川崎大師に行った。
10 年に 1 度のありがたい御札が貰える期間で、人々の信仰は根強いものだと感じた。
帰り際にコンビニに寄ったら白州ミニボトルが売っていて激アツだった。
!20240520.webp|白州ミニボトル

2024/5/21
10 時過ぎに起床。秋葉原でSDカードを買ってつくばへ。
＊＊という大学院授業をこれまで頑張って履修してきたが、
＊＊＊＊＊＊、＊＊＊＊＊、＊＊＊＊＊＊という 3 条件が揃ったので履修を放棄しようかと思う……（その後、結局継続して履修することにした）。
今日は負けです。

2024/5/22
朝からゼミ、昼に三食に行った。
大学院の出願等で忙しく、あまり余裕がないな、という感じになってきた。
夜は雙峰祭企画の打ち合わせでココスに行ったが、諸々あって退店し、ジョイフルに行った。
酒を煽って色々と話しているうちにぬーんという感じに……。

2024/5/23
反町の森公園で宴会をして帰宅、7 時頃に就寝。
起きてちょっと仕事をした後、ミーティングに出た。
そろそろ仕事も 3 年ですねと言われ、結構続いたなと感慨を憶えた。
夜は研究室の人々と大将別館という居酒屋に行った。
!20240523.webp|夕暮れ

2024/5/24
酒飲んで気分が良くなったので、ひとりで深夜のペデを南端まで散歩した。
洞峰公園を抜けたあたりでだいぶ気味が悪くなってきたので夜道には要注意（人曰く親父狩りが出るらしい）。
そのまま東大通りに抜け、4 時間ほど散歩をして帰ってきた。
朝の授業は寝坊して昼からゼミ。指導教員との面談を経て研究テーマが決まった。
めでたい！！！ めでたいので同期と七福に行った。 

2024/5/25
研究計画書の初稿を書いてチェックを投げた。
取り敢えず出願は間に合いそう……。
夕方から新宿に行った。
東京（特に西側）、人が多くて苦手すぎる。
将来は東京都江東区に住みたいです。

2024/5/26
組込みプログラム開発という＊＊の課題を消化するために Java を書く必要があったが、＊＊＊＊＊＊。
近所のスーパーが寒かった。 

2024/5/27
朝からゼミ。少し仮眠を挟んで英語輪講のチェック、雑談、研究相談等をした。
研究室でボドゲをしたら盛り上がり、結構たのしかった。
研究計画書は指導員教員から暫定で OK を貰えたので今週中には出願間に合いそう……。
夜から課題消化。

2024/5/28
朝まで研究室にいて課題を消化して 5 時頃に帰宅。昼過ぎに起床。
組込みプログラムの課題発表をした後、友人と合流し、出願用の写真を撮ってもらった。
夜は＊＊にらーめんを食べに行ったが、もう良いかな……という感じだった。
!20240528.webp|キロロとキーバ

2024/5/29
朝方に帰宅し、8 時頃に起床。
朝からゼミ。昼に研究室の人たちと本部棟レストランに行った。
＊＊＊＊＊＊し、その修正をしていた。21 時過ぎに帰宅して即寝。

2024/5/30
ひたすら眠くて 14 時まで寝てしまった。16 時間睡眠……。
奇しくも仕事の週次ミーティングがスキップになった。
夕方から友人とはま寿司に行き、Swarm のメイヤーを剥奪。
夜から研究計画書の大詰めとゼミ資料の執筆に研究室にきた。

2024/5/31
ドーナツを食べながら、研究計画書とゼミ資料を徹夜で書き上げた。朝にマックに行ったあたりでかなり体調が悪くなり、爆睡。
昼からゼミに出て、なんとか Web 出願を終えた。
夜に研究室の飲み会で灯禾軒（jsys21 の雙峰祭打ち上げ以来）に行き、久しぶりにドカ飲み！をした。 
!20240531.webp|ミスタードーナツ

5 月のふりかえり
目まぐるしく動いた5月だった。
最近は研究にわりとリソースを割いていて、週 3で労働、その他は研究室という生活になっていたので余裕はかなり少なかった。
とはいえ、ひとまず 5 月の山場であった卒研テーマ決めと出願が終わり一段落。
当面は＊＊＊＊＊＊という話になったので、実験計画等を立てていきたいと思います。 

2024/6/1
8 時頃に自ずと目が醒めた。
先々週に引き続き、2 限から情報理工特別講義（Kotlin の授業）の 2 回目。
昼に福軒に行って回鍋肉を食べた。
帰りにやど祭に少し寄った。

2024/6/2
疲れが溜まっていたので夕方まで寝た。
起きて 2 週間分のユーフォを消化。
徹夜で諸々の進捗を生んだ。

2024/6/3
朝からゼミ。
研究室の同期と院試の出願（書類提出）を済ませ、そのまま粉クリに行った。
仮眠を少し取り、英語輪講の相互チェックをした。
夕方からメ創の集まりに行ったが、意識の高そうな人々が集まっていてはえーとなっていた。
タイポグラフィの話を少しした。
夜にオタク達と大元に行った。野菜炒めの肉が赤かった。
!20240603.webp|筑波大学 3A 棟

2024/6/4
昼まで寝て授業。友人と夜にフライパンに行き、諸々の近況報告をした。
友人は就職するらしい。
カツ定食のボリュームの大きさにびっくり。

2024/6/5
朝からゼミ、昼にカレーを食べた。
雑談や研究計画の立案等をして、夜から jsys 同窓会でえん弥に行った。
人々には人々の人生、という感じだなあと思った。
反町の森公園で二次会をした。
!20240605.webp|えん弥

2024/6/6
朝 5 時前に帰宅。
仮眠を取り、11 時過ぎから某企業と夏インターンの面接。
＊＊＊＊＊＊。
12 時過ぎに二度寝して起きたら 18 時過ぎだった。
風呂に入って研究室に行き、ちょっと研究をした。
その後、友人宅にコーヒーを飲みに行った。 

2024/6/7
朝まで友人宅で作業をして就寝。
珍しくゼミがなかったので、13 時過ぎまで寝てがくに行った。
野菜らーめんを食べて気絶し再度昼寝。
16 時過ぎに起き、コーヒー屋にカフェオレを飲みに行った。
その後は研究室で課題消化。
夜に松屋に行った。

2024/6/8
アニメを観ながら明日の資料を書いていたら朝になっていた。
研究室から帰り、宿舎の部屋が見るに耐えない状態になっていたので朝から掃除。
若干の仮眠を挟んで正午過ぎに起床した。
jsys/IPC 研修（Web フロントエンドを教える会）の第 1 週に呼ばれ、HTML, CSS, JS を教えていた。
jsys25？の代が居てかなり感動。
夜にオタク達とスシローに行った。

2024/6/9
日も回る頃にホワイトバジルに行った。
綺麗なお酒がいっぱい並んでいて感動！！ 先輩が座っていたので、久しぶりに少し喋った。
そのまま大学で二次会をして朝 7 時頃に帰宅。
目が覚めると 17 時過ぎで、風呂に入って買い出しに行った。
特に何もせずに一日が終わる。 
!20240609.webp|ホワイトバジル

2024/6/10
朝まで労働して、徹夜でゼミに参加。
昼に粉クリに行った。
少し仮眠を取り、英語の対訳をした。
夜に研究室の人々と益さんに行った。
23 時頃に帰宅し、耐えきれない眠気が来たので仮眠。

2024/6/11
仮眠、と思って起きたら 17 時だった。
授業出席失敗……。
春が過ぎたのに最近はかなり眠いですね。
18 時半から雙峰祭の第 1 回企団連があったので参加して、その後にオタク達とタコスをした。
学部 4 年になってから人間たちと会わなくなったね、という話をした。

2024/6/12
朝まで友人宅にいた。
そのままゼミ、昼に三食に行った。
研究相談等をして、もう少し実験計画等を練ったほうが良いですねという話になった。
文を書くのは嫌いな作業ではないものの、かなり神経を使うのでタスク的には重い。
仮眠を取った後、油虎に行こうという話になったので先輩の車で向かったが、空いてなかったのではりけんラーメンにフォールバックした。

2024/6/13
研究室で爆睡し、起きたらみんな帰っていたので帰宅。
眠れなかったので研究学園の方まで散歩をした。
6 時前に就寝し、10 時前に起床。実験協力に行ったら 1 実験に 2 時間半も掛かり驚いた。
その後は吸い込まれるように ZEYO. に入り、冷やしカレーうどんを食べて就寝した。

2024/6/14
朝 0 時頃に起床。
そのまま作業をして、久しぶりに 1 限に出た。
友人がいた。
昼からゼミに出て、研究相談、雑談等をして夕食に金の馬結に行った。
研究室で酒を飲みながらアニメを見た後、coins ラウンジで jsys/IPC 研修 2 日目の資料を書いていた。
＊＊のデザインを見せてもらい、人類の長年の夢であった縦書きが実現されていて感動した。

2024/6/15
研修 2 日目。
TypeScript を教えるつもりだったが、疲れが溜まっていたので資料だけ投げて爆睡していた。
夜に高麗に行った。

2024/6/16
研修 3 日目。
React を教えた。
祖父の訃報が入ったので途中で抜け、新幹線で大阪に来た。
梅田でひとりでお好み焼きを食べた。 
!20240616.webp|お好み焼き

2024/6/17–18
祖父のお通夜、そして葬式に行った。
特に感傷的になることもなく、ぼーっと式を眺めていたら終わってしまって、人の死は儚く、そして自分は冷淡な人間だなあと思った。
尾崎豊「Forget-me-not」が脳内を過っていた。 

2024/6/19
親は没後の諸々の手続きに忙しそうにしていた。
私は朝からゼミに出て、昼からは労働をしていた。
夜にお好み焼きを食べた。

2024/6/20
家族や親族と別れ、ひとりで京都に行った。
ユーフォの聖地、見てみたいなと思ったので 6 年ぶりに宇治に行き、宇治川近辺を散歩した。
平等院も参拝した。
十分に宇治を満喫した後、京阪で市内に上り、白川通の天一でらーめんを食べた。
これが総本店の味か……。
そのまま夜中の出町柳周辺と四条通りを散歩した。
!20240620.webp|宇治川河川敷

2024/6/21
ネカフェに泊まり、朝まで漫画を読んでいた。
11 時過ぎに起床。昨日とは打って変わって快晴な一日で、本願寺界隈を参拝した。
少し遅めの昼食として適当な店に入り、茶そばを食べ、その後は JR 京都駅の大階段や屋上庭園を散策していた。
将来は 4 年ほど京都に住むとよさそうだと感じた。23 時過ぎに川崎に帰宅。
!20240621.webp|京都タワー

2024/6/23
昼頃に起床。
夏に着る服がなかったので下北沢に行ってアロハシャツを買い込んだ。
今年の夏はアロハシャツで乗り切るぞ。

2024/6/24
今日までの課題があったので、夜中に研究室に来て課題を消化した。
朝からゼミ、昼に人々とスタバに行った。
あとユーフォ最新話の鑑賞会をした、良かった……。
午後から英語の対訳、夜からは明日までの課題を消化した。
1 週間ぶりに大学に来た。 

2024/6/25
組込みプログラム開発の最終課題をするために大学に籠り、なんとか開発を終えた。
深夜に清六家に、昼に松屋に行った。
発表はそつなく終わった。
夜にオタク達と楽蔵に行った。

2024/6/26
朝からゼミ。
昼は三食の麺を食べた。
実装を進め、夜に盛清六に行った。

2024/6/27
マジで一日寝ていたら終わった。
夜にカレーメシを食べた。

2024/6/28
春 AB が終わったので授業がなくなった。
昼からゼミ……のはずだったが大雨で外出する気が失せたのでオンラインで参加し、雨が弱くなってから実験協力に向かった。
実験器具との相性が悪く、実験には参加できなかった。
来週の推薦入試に向けて面接の想定問答を考えた。
夜に研究室の人々と油虎に行った。
半年ぶり！

2024/6/29
前から気になっていた「氷菓」を研究室で見始め、19 話まで見てから帰った。
かなり面白かった。
少し仮眠し、19 時半のつくば号で川崎に戻った。 

2024/6/30
6月最終日！ 朝まで面接の質疑応答と研究の実装を進めた。
ついでに個人サイトに5月分の日記を載せた（いまさら）。
午前 10 時過ぎに就寝。
16 時頃に起きて、響け！ユーフォニアムの最終回を観た。
いや、素晴らしかった……。
ご飯を食べてつくば号でつくばに来た。

6 月のふりかえり
5月に比べて余裕のある一月だった。
進捗があるかと問われれば答えに窮するがまあ……。
来月は院試があるのと、実験を本格的に進めていく必要があるので引き続きやっていくぞという感じです。

2024/7/1
指導教員が出張に出てゼミがなかったため、ゆっくり起床して昼から研究室に行った。
胃腸の調子が悪かったので散歩をしてカット野菜を食べたら大分回復した。
粉クリに行き、レジ前に並んでいるクッキーを初めて買ったが結構美味しかった。
早ければ 7 月下旬には実験に入りたいですねと話していた。

2024/7/2
午前 1 時前に就寝、10 時半頃に起きた。
昼にオタク達とドルフに行き、そのまま coins ラウンジに行って卒研の内容を相談した。
帰って仮眠し、夜から労働。

2024/7/3
労働と趣味開発をして、朝からゼミ。
昼に研究室同期ととんとこ豚に行き、味噌カツを食べた。
院試に勝つぞ……。
午後は雑談と面接対策をしていた。
!20240703.webp|とんとこ豚

2024/7/4
昼過ぎまで爆睡していた。
TL を見たら IPA 試験の結果が出ていたので見たらネスペに受かっていてびっくり。
部屋の掃除をして面接対策をした。
夜に蒼に行った。
院試勢頑張っていきましょう〜〜。

2024/7/5
生活習慣の乱れと緊張から寝付けず、面接練習やネットサーフィンをして朝になっていた。
8 時前に寝落ち、10 時半頃に起床。
酷暑のなか 12 時頃に研究室に行き、同期とちょっと喋ったのち面接会場に移動。
友人らがいた。
面接は 7 分ほどで、呆気なく終わった。
＊＊＊＊＊＊、＊＊＊＊＊＊。
その後は研究室に戻り、短冊を書いたり雑談をしたりして過ごした。
夜にオタク達と三八に行った。
お好み焼きはまだやっていなかったので、チキン南蛮定食を食べた。 
!20240705.webp|研究室の短冊

2024/7/6
実家に帰ってきて爆睡。
疲れが溜まっていたのでマジで一日寝ていた。

2024/7/7
個人開発をちょっとしてあとは寝ていた。
地元のらーめん屋に行った。

2024/7/8
酷暑の一日で、外出した瞬間に暑い以上の感想が出てこなかった。
ここは東南アジアか。
昼頃につくばに着いて研究室の人々としゃぶしゃぶに行った。
院試おつかれということで先輩に奢ってもらった。
酷暑で擦り減った体力も肉を食べたら幾分か回復した。
昼過ぎから輪講チェック、レポート消化を経て一日おわり。

2024/7/9
朝からゼミ、昼に粉クリに行き冷製パスタを食べた。
午後は実装を進め、夜に福軒に行って油淋鶏を食べた。
この夏はじめてスイカを食べた。
日が回る前に友人宅に転がりこみ、雑談をしつつ作業をした。

2024/7/10
徹夜開けに朝からゼミ。
夏休み前最後の輪講だった。
昼にカレーを食べて、雑談をしたり実装をしたりした。
夜に松屋に行った。

2024/7/11
朝 1 時過ぎに帰宅、眠れなかったので深夜徘徊をして、4時前に就寝。
17 時頃に起きた。
夜に研究室同期と推薦入試の打ち上げで大将別館に行った。
過冷却酒や生牡蠣なんかを食べた。
酒も料理も美味くて（しかも結構安価）ニコニコになった。
アルコールも回っていたので帰って爆睡した。 
!20240711.webp|大将別館の刺身

2024/7/12
昨日寝すぎたのか 3 時頃に中途覚醒した。
特に作業する気もなかったのでだらだらネットサーフィンをしていた。
7 時半頃に寝落ちし、起きたときには 13 時過ぎだった。
洗濯を済ませてらーめんを食べに行き、二度寝を挟んで 17 時頃に研究室に行った。
20 時のつくば号で実家に帰宅。

2024/7/13
朝まで実装を進めていた。
実験で使うシステムのリファクタが必要になり、ここ 3 日ほど BLE に苦戦していた。
9 時過ぎに就寝し、14 時半頃に起床。
映画デデデデを駆け込みで見に行った。
原作を最後まで読めていないのでこんなんだっけ？と思いつつ、とりあえず破壊力があってよかった。

2024/7/14
朝方まで実装し、16 時前に起きた。
ネスペの合格祝いで家族と焼肉に行った。
ついでに改装された川崎市庁舎も見てきた。
帰ってドカ寝。

2024/7/15
起きたら朝の 2 時過ぎだった。
昼過ぎまで掛けて実験システムの実装をほぼ終え、16:40 のつくば号に乗ってつくばに来た。
夜に研究室同期と焼肉をした。
コストコの肉厚な牛タンを贅沢に焼いてガチの最強になってしまった。
!20240715.webp|牛タン

2024/7/16
朝からゼミ。
昼に粉クリに行った。
午後はチーム研究の実験をして、企団連に出た。

2024/7/17
リスケになった人の実験をするために 10 時半から研究室へ。
昼にカレーを食べた。
仮眠を挟んだのち仕事のミーティングに出た。
入試の発表が明日なのでくす玉を作っていた。

2024/7/18
朝からゼミ、進捗報告の担当回だったが、難なく終わってよかった。
午後に粉クリに行って、雑談をしていた。
同期も含めて、入試も無事に受かったのでみんなでくす玉を割った。
夕方から雙峰祭の食品衛生講習会に行って、オタク達とお好み焼きを食べた。
良い一日だった。

2024/7/19
寝れなくて朝まで起きていたので、早朝にトライアルまで散歩したりしていた。
最近の猛暑でエアコンなしでは寝れず、酒でも飲んで気を紛らわすかと思っていたところで実験の連絡（明日だと勘違いしていた）を貰ったので急いで研究室に行った。
研究室のソファで仮眠するつもりが爆睡してしまい、起きた時には 19 時を回っていた。
雑談をしつつちょっと研究を進め、清六屋に行って帰ってきた。 

2024/7/20
朝 3 時頃に就寝し、なぜか 7 時台には起きてしまった。
午後から友人とビアフェスに行ったが、流石に暑すぎたので 2 杯ほどでダウン。
18 時過ぎに研究室同期と再度行き、4 杯ほどビールを飲み、さらにコンビニで酒を買い足し、家から酒を持ってきて研究室で飲んでいた。
＊＊＊＊＊＊、＊＊＊＊＊＊。
深夜 3 時半頃には解散した。
!20240720.webp|ビアフェス

2024/7/21
解散した後帰る余力もなく研究室で爆睡し、起きたら午後 3 時だった。
12 時間睡眠……。
昨日の話が微妙に尾を引いていて、うーん酒はよくないっすねの感情になっていた。
夕方にオタク達と集合して、既にビアフェスは撤収していたためサイゼリヤに行き、4 時間ほど飲んだ。
学部 4 年になってから人生……みたいな話をする機会が急増しており、友人の話す通り周囲の世界が進んでいるという感情を隠せなくなりつつある。 

2024/7/22
オタクの家で Wii Sports Resort をやったら眠くなってきたので就寝。
7 時半頃に目覚めて帰った。
自分に今必要なものはエアコンだと悟り、朝から物件を探して不動産屋に行った。
今度内見に行こう……。
午後から研究室に赴き、雑談、研究相談、実験などをした。
一月ぶりくらいに高校の友人と会い、大戸屋に行った。
深夜に散歩をしていたら無性にアルコールが摂取したくなり、つくばセンターで酒を煽っていた。

2024/7/23
8 時前に目覚めた。
朝からネットサーフィンをしつつシャワーを浴び、昼頃に研究室に行った。
実験が近いので研究や研究相談をした。
夕方に所用で＊＊に行き、次いでに coins のオタクと楽蔵に行った。
＊＊に遭遇したな。
＊＊＊＊＊＊、どうしたものか……になっている。

2024/7/24
最近暑くてマジで寝てられん。
朝 8 頃に目覚めたが、流石に暑すぎたので頑張って二度寝。
それでも 13 時頃には起きた。
研究室に来て、実験やっていいよと許可が出たので来週から実験を開始する予定。
＊＊＊＊＊＊。
夜に同期と鶏々に行った。

2024/7/25
朝まで研究室にいた。
松屋に行ってゼミに出て、粉クリに行った後帰宅。
特に何もしない一日だった。

2024/7/26
週末の大学説明会に駆り出されるので朝からその資料作り。
昼に友人とらんぷに行った、3 年ぶりだった。
その後不動産屋に行き 5 軒内見をした。
社会性ポイントを使い果たし一日終了。
このままだと研究していたら夏が終わってしまう！！旅行に行くぞ！！と旅行の機運を生やした。
!20240726.webp|らんぷのパフェ

2024/7/27
2 週間ぶり実家。
エアコンがある環境って素晴らしい。
来週に着手報告があるのでそのスライド作成と、実験に向けた準備をしていた。
大学説明会の資料を見ていて、自分は人間と交流するのは好きでも得意でもないが、しかし人間としての未練を捨てきれないなあみたいな気持ちになっていた。

2024/7/28
徹夜で労働。
僅かに仮眠を取って昼から大学説明会（オンライン）に出た。
スライド（https://www.iplab.cs.tsukuba.ac.jp/~wada/mast2024.pdf）はそこそこよく出来ていたんじゃないか？という気がしたな。
手を動かして情報学を学ぶのは楽しく、大学で重要なものは座学ではなく人だ、みたいな話をしていた。
安達としまむらの新刊買った！！

2024/7/29
朝からゼミ、発表練習をした。
昼から友人の運転で銚子に行った。
最近消息を絶っていた友人とも久しぶりに会えて良かった。
海鮮丼を食べ、銚子ポートタワーに上り、犬吠埼で海を見てから地球の丸く見える丘展望台へ行った。
いや〜海っていいな！ 20 時前にレンタカーを返却し、コスモスに行った。
!20240729.webp|犬吠埼

2024/7/30
早朝に頑張って起き、研究室に行った。
深夜 3 時から実験システムのバグ取りを進め、11 時にようやく実験開始。
読みが甘かったのか一人あたり 2 時間以上掛かってしまった。
しかも ＊＊＊＊＊＊、カスの感情になった。
＊＊＊＊＊＊。
19 時過ぎから爆睡し、0 時を回った頃に起きて大元に行った。
雙峰祭の申請書類を書いて、夜から労働を始めた。

2024/7/31
7 月最終日。
個人研究の実験2日目で、若干の休憩を挟みつつ 11 時から 19 時半までぶっ通して実験していた。
昨日と合わせて半分（6 人）まで行ったが、そこそこ良い結果が出るんじゃないか？という気がするな。
20 時頃にぶっ倒れて爆睡していた。

7 月のふりかえり
院試、打ち上げ、研究、ビアフェス、引越し検討みたいな一月だった。
ひとまず向こう 2 年の進路を確保できたことと、予定通り 7 月にはギリギリ実験に入れたのはかなり良かった。
来月はお盆にインターン、月末に学会締切があり夏休み……という感じだが引き続き緩やかに進めていきます。

2024/8/1
朝 5 時前に起きて帰宅。
松屋の朝定食を食べた。
その後（経過途中ではあるものの）実験の分析を軽くして、10 時に実験協力のために再度大学へ。
昼にオタクと本部棟レストランに行った。
12:45 から着手報告会（2 日間に分けて研究室内で研究内容を報告する会）1 日目。
今日は特に発表もないので、Discord に適当にチャットを立てて盛り上がっていた。
夕方にスタバへ行き、夜は研究室の人々とタコスをした。 

2024/8/2
5時前に起床。10 時半から仕事のミーティングに出た。
昼は三食でカレーを食べた。
着手報告会 2 日目。今日も適当にチャットで雑談をしつつ、＊＊＊＊＊＊。
夜に打ち上げでしゃぶしゃぶに行くはずだったが、空いてなかったのでとん Q に行った。 

2024/8/3
11–18時で実験、無事に 8 人目まで終わった。
オープンキャンパスの季節で、学内は大量の高校生で溢れていた。
coins の受付を知り合いがやっていたのでちょっと入れてもらって、軽く写真を撮った。
夜に研究室同期とがくに行った。 

2024/8/4
実家。
久しぶりに 13 時間ほど眠って、よく寝た。
髪がボサボサだったので切りに行った。

2024/8/5
労働と研究をした。
地元で花火があったが、流石に人混みの中には混じる気力はなかったので対岸の大黒ふ頭から見た。
京浜臨海部かなり好きです。
!20240805.webp|花火大会

2024/8/6
実家のテレビを付けたら広島の式典をやっていて、8 月も終戦記念日間近だなーと思った。
今年は 8 月になっても筑波にいる頻度が多いので夏休み感があまりしない。
昼からつくばに来て実験 4 日目、10 人まで終わった。
昼を食べそびれたので夕食は北方園でドカ食いした。夜から労働。

2024/8/7
11 時頃に起床。
実験 5 日目。
ようやく 12 人全員終わった、長かった……。
実験設計が正しかったかという若干の疑問は残りつつも、一応予想通りの結果が出たので論文にしていくぞという意気込みです。 

2024/8/8
13 時過ぎに起きて研究。
実験協力で人生で初めてあやとりを触った。
異国龍行った。 

2024/8/9
朝方まで研究を進め、4 時頃に帰宅。
9 時前に起床して豊里ゆかりの森に行った。
雙峰祭の事前演習兼決起集会を兼ねつつ、オタク達と肉を焼いた。
15 時に撤退し、そのまま喜楽里別邸に行って、河川敷で花火をした。
夏おわる。

2024/8/10
10 時過ぎに起床。コミケのリストバンド（入場証）を買いに秋葉原へ。
午前入場分はどの店も完売していて焦ったが、Twitter の見知らぬ方に譲ってもらい事なきを得た。
それにしても凄い人混みだこと……。
実家に戻り同人誌の整理やサークル一覧をチェックしつつ、明日に向け準備をしていた。
明日から C104！

2024/8/11
C104 一日目！ 2 時台に就寝し、7 時前に起きた。
コミケにしては遅めの起床。
りんかい線に揺られて 9 時前に国際展示場に着いた。
東の午前入場に並んだが、待機列のある東駐車場は既にフライパンになっていて、温度計は 39℃ を超えていた。
水と塩分タブレットをがぶ飲みして耐えたものの、周囲では運ばれる人が続出し、これ以上温暖化が進めばもう夏コミは厳しいかな……と感じた。
3 時間ほど並んで 12 時前に入場。
目当てのサークルやユーフォ、きららの島を巡った。
シャッター前にさらに 1 時間ほど並んだあたりで体力的にかなり摩耗してしまい、その後やや惰性気味に東や企業ブースを回った結果、買い損ね or 売り切れが続出してしまった。
2 日目（のほうが好みのジャンルが多かった）行きたかったな……と脳裏の片隅にあったのも大きい。
16 時の閉会とともに撤退し、天王洲アイルから歩いて北品川の銭湯でひとっ風呂浴びた。
汗だくで不快指数が max だったのでこれはかなり正解ルートだった。
その後は例によって大崎の六厘舎へ。
前回に比べて負けを感じたコミケだったが、それでも同人誌即売会はたのしいなと思った。
冬コミでリベンジや！ 
!20240811.webp|東京ビッグサイト

2024/8/12
昨日は結局熱中症っぽい症状に襲われ、22 時半には寝た。
6 時半に起床。
夏コミ行きて〜〜という気持ちを抑え、ビルだらけの大手町に居た。
某社インターン 1 日目。
軽く講義を受けた後、ハッカソン形式なのでどういういうものを作りたいか、みたいな話をしていた。
夜に懇親会があり、お酒を飲んでいたらやっぱコミケ行きたかった〜〜！！という気持ちになったので夜の東京ビッグサイトを観に行って散歩した。
そして寝過ごして磯子まで来てしまった、草。
!20240812.webp|東京駅

2024/8/13
いんたん 2 日目。フロントエンドを書いた。
社内見学させてもらって新聞社ってこんな感じか〜〜となった。
帰宅後、メロブで行けなかったサークルさんの新刊を注文した。

2024/8/14
いんたん 3 日目。
大手町―東京ルート完全に理解した。

2024/8/15
いんたん 4 日目。
最強のフロントエンドを書いてしまった。
論文執筆もちょっと進めた、締切まであと 2 週間しかなくて不味い。 

2024/8/16
いんたん最終日。
台風直撃の予報（結局外れて東京はそよ風程度だった）になったためオンライン開催になった。
＊＊＊＊＊＊。
＊＊＊＊＊＊と思う。

2024/8/17
朝方に就寝し、昼過ぎに起きた。
春夏秋冬恒例の中学の同期らと集まる会。
不健康の権化だったオタク達も 20 代になると健康に気をつけ始めていて、勧められてあすけんを入れた。
それで昼にスシロー、間食で飲酒、深夜に天一に行ってドカ食いをしたところ摂取カロリーが 3000 kcal を超えていてこれは不味いなと感じた。
明日は断食するぞ。
夜に線香花火をしながら友人が「花火は夏を終わらせるための儀式」と話していた。 
!20240817.webp|線香花火


2024/8/18
深夜に天一を食べてドカ食い気絶した（成人式の帰り以来）。
友人宅で寝て起きたら朝 7 時だった。
帰宅して労働。
夕方に新宿で催されていた安達としまむらポップアップストアに行ったが、グッズはほぼ完売だったので写真だけ撮って帰ってきた。
通販で買おう……。
付近の有名なつけ麺屋（五ノ神製作所）に入った。
帰宅して再度労働。
!20240818.webp|入道雲

2024/8/19
昼過ぎに起きて労働。
「負けヒロインが多すぎる！」の最新話まで追った。
エモすぎ……。
夜に散歩してまた労働。

2024/8/20
朝方まで労働。
12 時過ぎに起きて論文執筆。
matplotlib や R とバトルした。
統計わからん。
最近は意識的に野菜を食べるようにしている。

2024/8/21
朝まで労働をして就寝。
10 時半頃に起きた。
短い短い夏休みも終わりを告げ、良くも悪くも日常に戻ってしまった。
行きしなに秋葉原のメロブでコミケ新刊を受け取ってからつくばへ。
仕事のミーティングに出た後に研究室に行った。
一般入試終わりの同期らと雑談しつつ、論文の修正をした。
入試も終わったしな、と言って大学でタコスを作って食べた。

2024/8/22
眠かったのでゼミはオンラインで出た。
12 時半過ぎに起床し、13 時半から実験協力。
システムが動かないとかで 16 時前まで掛かった。
明日までに初稿を出すように言われたので書いていた。 

2024/8/23
深夜に気分転換で桜の方に散歩しつつ論文執筆を進め、帰宅。
14 時過ぎに起きた。
第 3 稿を書いて共著者に送り、修正して指導教員に送った。
あと一週間！
う〜〜苦しい苦しい。

2024/8/24
朝方まで起きていて、8 時前に就寝。
15 時頃に起き、Swift とバトルをした。
指導教員からメールが帰ってきていて、予稿に対して概ね良さげな反応だったので安心した。
負けヒロイン最新話観た、本当にエモすぎる……。

2024/8/25
6時頃まで起きて論文修正。若干仮眠を取って日本のグラフィックデザイン 2024へ。
毎年観ているが今年は刺さる作品がそれほどなかった。
昼にうどんを食べて、市谷の杜 本と活字館に行った。
こちらはマジの激アツで良かった。
写研の資料があってびっくり！ 適当な駅で夜ご飯を食べようとなり、乱数を振ったら押上が出たので半蔵門線で押上に行った。とんかつを食べた。
!20240825.webp|下町とスカイツリー

2024/8/26
帰ってきて朝方まで労働。
＊＊わからん……。
ゼミにオンラインで出た後、3 時間ほど睡眠した。
日本語修正バトルを無限にしているがマジで分からんすぎる。

2024/8/27
9 時半に起床してつくばに向かった。14 時半から指導教員と面談。
＊＊＊＊＊＊。
高校の友人が大学院の受験に来ていたので、雑談をしつつ北方園に行った。
その後は研究室に戻って雑談をしつつ、論文修正を進めた。

2024/8/28
朝方に帰宅して朝からゼミ。
久しぶりに昼にカレーを食べた。
午後は論文修正と仕事のミーティングに出て仮眠。
夜に研究室同期と喜羊羊のジンギスカン食べ放題に行った。
＊＊＊＊＊＊良かったと褒めていたので行ってみたが、3,900 円＋飲み物でサービスも良く、かなり美味くて最強になった。 
!20240828.webp|ジンギスカン

2024/8/29
朝からゼミ。一日研究してた。動画編集するために 2 年ぶりくらいに Premiere 入れた。 

2024/8/30
一日研究してた 2。
2 年ぶりに Premiere を触っておーっとなった。
研究室の先輩が学会投稿を終えた（締切が一日早い）のでついでにピザを食べ、鶏々に行った。

2024/8/31
8 月最終日。
朝 7 時頃までデモ動画をつくり、大学で若干仮眠。
10 時頃に起きて再度論文修正を始めた。
その後はひたすら共著者にチェックしてもらって、22 時半頃にようやく完成した（24 時が〆切）。
投稿システムが 504 を返していて危うかったが、ギリ投稿を完了させ、そうして 8 月が終わった。
先輩と研究室で酒を飲み、大元に行った。マジで美味い酒だった。

8 月のふりかえり
苦しかった！！とにかく苦しかった！！ 着手発表に始まり、実験、インターン、学会投稿と忙殺され、無限に苦しい一ヶ月だった。
＊＊＊＊＊＊……。
文章は良くしようと思えば無限に良くなっていくが、その分無限にリソースも食われていくので落としどころの難しさを感じた。
当面は＊＊＊＊＊＊なので、9月は余暇と旅行に勤しみます。 
`;

export default text;
