export const nengajo = [
  {
    year: 2024,
    src: "./assets/nenga2024.webp",
    width: 4196,
    height: 2835,
    alt: `「あけましておめでとうございます。旧年中は大変お世話になりました。本年もどうぞよろしくお願い申し上げます。」の文言が右上に添えられています。
  「幕張の浜／千葉市美浜区」の文言が右下には添えられています。
  背後には夕暮れ時の海岸が写っており、一面がオレンジと青色のグラデーションに染まっています。
  岩場には、黄色いまんまるのぬいぐるみが微笑んでいます。
  `,
  },
  {
    year: 2023,
    src: "./assets/nenga2023.webp",
    width: 4196,
    height: 2835,
    alt: `「あけましておめでとうございます。旧年中は大変お世話になりました。今年もどうぞよろしくお願い申し上げます。」の文言が左上に添えられています。
  下部には、細長く耳が伸びた黄色いまんまるのぬいぐるみが微笑んでいます。
  背後には色鮮やかに桜が咲いており、春の予感を到来させます。`,
  },
  {
    year: 2022,
    src: "./assets/nenga2022.webp",
    width: 2551,
    height: 3776,
    alt: `「あけましておめでとうございます。旧年中は大変お世話になりました。本年もどうぞよろしくお願い申し上げます。の文言が左上に添えられています。
  左下で黄色いまんまるのぬいぐるみが微笑んでいます。
  背後にはクリスマスイルミネーションに照らされた東京駅が写っており、色鮮やかな花火が空を夜空を彩っています。`,
  },
];
